sulaolab/sonora-ak-nano/src/app/hal_touch/nora_itc_dspic33ak.c
/* Provenance: written from DS70005591 ch.18 (ITC), ch.30 (ADC) and the DFP SFR
 * header p33AK512MPS512.h only. No vendor touch-library source, header or
 * binary was consulted; the data sheet's Example 18-4 was read for facts about
 * the silicon and not transcribed.
 */

#include "nora_itc_internal.h"

#include <stddef.h>

#include <xc.h>

#include "nora_itc_dspic33ak_reg.h"

/* ---------------------------------------------------------------------------
 * Is there an ITC on this part?
 *
 * The dsPIC33AK128MC106 configuration targets a motor-control part with no ITC
 * and no ADC 5: every register below is simply absent from its DFP header, so
 * this file failed to compile for that configuration with 20 "undeclared here"
 * errors. It went unnoticed because that configuration had not been built since
 * open touch became the default.
 *
 * The guard is the DFP header's own object-like macro (p33AK512MPS512.h has
 * "#define ITCLS0CON ITCLS0CON" beside the SFR declaration), so the question
 * asked is "does this device have the peripheral", not "which device name did
 * someone type". The stubs below answer NORA_ITC_ERR_UNSUPPORTED, which
 * nora_itc_internal.h already defines as "not an AK512" -- so this is the designed
 * answer, not a workaround: nora_touch_init() fails cleanly, main.c already
 * handles that, and nothing needs excluding from the project.
 * ------------------------------------------------------------------------- */
#if defined(ITCLS0CON)

/* ---------------------------------------------------------------------------
 * Per-list register set, indexed by list number — the same shape the other
 * dsPIC33AK backends use for their instances (see nora_spi_dspic33ak.c). The
 * row is pasted from the number rather than written out, so an index and its
 * ITCLSx registers cannot disagree. The table is a definition, so it stays
 * here; its type and the field positions it is used with are in
 * nora_itc_dspic33ak_reg.h.
 *
 * Unlike SPI there is no per-row #if and no unused [0]: the three lists exist
 * on every part that has an ITC at all, and list 0 is a real list.
 * ------------------------------------------------------------------------- */
#define ITC_LIST_REG_ROW(n)   { &ITCLS##n##CON, &ITCLS##n##SEQ, &ITCLS##n##TMR, \
                                &ITCLS##n##STAT, &ITCLS##n##MUL }

static const itc_list_regs_t itc_list_regs[NORA_ITC_LIST_COUNT] = {
    ITC_LIST_REG_ROW(0),   /* [0] ITCLS0 */
    ITC_LIST_REG_ROW(1),   /* [1] ITCLS1 */
    ITC_LIST_REG_ROW(2),   /* [2] ITCLS2 */
};

/* ---------------------------------------------------------------------------
 * Driver state
 * ------------------------------------------------------------------------- */
typedef struct {
    bool                     initialized;
    bool                     scan_running;
    uint8_t                  record_count;
    uint8_t                  cvdcap;
    uint8_t                  acc_count;
    uint32_t                 clock_hz;
    uint16_t                 charge_counts;
    uint16_t                 balance_counts;
    uint32_t                 scans_completed;
    nora_itc_trigger_t       trigger;
    nora_itc_status_t        last_status;
    nora_itc_scan_callback_t callback;
} itc_list_state_t;

static itc_list_state_t itc_state[NORA_ITC_LIST_COUNT];
static bool             itc_hardware_started;

/* ---------------------------------------------------------------------------
 * Helpers
 * ------------------------------------------------------------------------- */

/* TAD is the ITC's unit of time, not a core clock cycle: §18.3.7 says the
 * acquisition and math sequencers run from the ADC 5 TAD clock, and spec AD50
 * gives TAD = FIN / 4 with 12.5 ns min and 125 ns max. On this board CLKGEN6 is
 * 200 MHz, so TAD is 20 ns, not the data sheet example's 12.5 ns. Every timer
 * value is therefore computed, never copied: a count lifted from the example
 * would be short by 1.6x and would present as a weak electrode. */
static uint32_t itc_tad_ps(uint32_t clock_hz)
{
    /* picoseconds, so 200 MHz -> 20000 ps with no rounding error to argue about */
    return (uint32_t)((4000000000UL / (clock_hz / 1000UL)));
}

static bool itc_ns_to_counts(uint32_t clock_hz, uint32_t ns, uint32_t max,
                             uint16_t *counts)
{
    uint32_t tad_ps = itc_tad_ps(clock_hz);
    uint32_t value;

    if (tad_ps == 0u) {
        return false;
    }

    /* Round up: a charge time that is short measures a partly charged
     * capacitor, which reads as a smaller signal and not as an error. */
    value = ((ns * 1000UL) + (tad_ps - 1u)) / tad_ps;

    /* A request that rounds to zero counts is rejected rather than silently
     * turned into "no delay" — it is the failure mode that looks electrical. */
    if ((value == 0u) || (value > max)) {
        return false;
    }

    *counts = (uint16_t)value;
    return true;
}

static bool itc_list_valid(nora_itc_list_t list)
{
    return ((unsigned)list < NORA_ITC_LIST_COUNT);
}

static void itc_reg_field_write(volatile uint32_t *reg, uint32_t shift,
                                uint32_t mask, uint32_t value)
{
    uint32_t tmp = *reg;

    tmp &= ~(mask << shift);
    tmp |= ((value & mask) << shift);
    *reg = tmp;
}

/* ---------------------------------------------------------------------------
 * The acquisition sequence
 *
 * Pseudo-differential CVD is two samples with the drive polarities swapped, and
 * the result is their difference. Sample A charges the internal CVD capacitor
 * to VDD while the electrode is held low, breaks the connection, connects the
 * two so the charge divides, and converts. Sample B does the same with both
 * polarities inverted. Subtracting cancels the converter's offset and most of
 * the common-mode injected noise, and it is why ITCCON1.SIGN must be set.
 *
 * Eight commands, in two groups of four, both carrying sequence number 4 so the
 * hardware runs them as one sequence; the SECOND bit marks the sample-B half so
 * the math sequence can tell which conversion it is looking at.
 *
 * The polarity assignment below (electrode low + capacitor high in sample A) is
 * the documented CVD arrangement, but which of PC0/PCC the silicon routes to
 * the capacitor node is a fact worth confirming with a scope on the first
 * board — the tuning manual's first bring-up step. Swapping the two samples
 * only flips the sign of every result, which is why a wrong guess here is
 * cheap; getting break-before-make wrong is not, and that is written as 3.
 * ------------------------------------------------------------------------- */
static void itc_program_acquisition_sequence(void)
{
    volatile uint32_t *cmd = ITC_DATACMD_ARRAY;
    /* Group B is never selected (ITCTXB stays 0) and the per-record GRDA/GRDB
     * fields are NONE, so PCB drives nothing; it is written Low rather than left
     * at 0 because 0 means "hand the pin back to TRIS/LAT" and only 1/2 are
     * driven levels -- see the DCMD_PC_* comment in the register header.
     *
     * PCA is the shield. With ENA_TOUCH_SHIELD_PHASE off, PCA is a static Low and
     * ITCTXA is 0, so it drives nothing at all and the shield's static Low comes
     * from RE4 as a GPIO (main.c) -- that is the condition every measurement up
     * to 2026-08-30 was taken under. With the switch on, ITCTXA selects CVDTX23
     * and PCA follows the sample's driven polarity: Low through sample A
     * (electrode Low, capacitor High) and High through sample B (both swapped).
     * That is the squarest available approximation of "the guard follows the CVD
     * waveform as closely as possible" (DS70005591 p.1485). It is held for all
     * four steps of a sample rather than only the charge step, because the
     * electrode is high-Z from break-before-make onwards and a shield that stops
     * driving mid-sample couples its own transition into the node being
     * measured. */
    uint32_t pcb_off  = ((uint32_t)DCMD_PC_LOW << DCMD_PCB_SHIFT);
    uint32_t shield_a = ((uint32_t)DCMD_PC_LOW << DCMD_PCA_SHIFT) | pcb_off;
#if defined(ENA_TOUCH_SHIELD_PHASE)
    uint32_t shield_b = ((uint32_t)DCMD_PC_HIGH << DCMD_PCA_SHIFT) | pcb_off;
#else
    uint32_t shield_b = shield_a;
#endif

    /* ---- Sample A ---------------------------------------------------- */
    /* charge the CVD capacitor, electrode held low, for timer A */
    cmd[0] = DCMD_CHRG |
             ((uint32_t)DCMD_PC_LOW  << DCMD_PC0_SHIFT) |
             ((uint32_t)DCMD_PC_HIGH << DCMD_PCC_SHIFT) |
             shield_a |
             ((uint32_t)DCMD_LOOP_TMRA << DCMD_LOOP_SHIFT);

    /* break before make: everything tri-stated, no wait */
    cmd[1] = ((uint32_t)DCMD_PC_TRISTATE << DCMD_PC0_SHIFT) |
             ((uint32_t)DCMD_PC_TRISTATE << DCMD_PCC_SHIFT) |
             shield_a;

    /* connect electrode and capacitor, settle for timer B */
    cmd[2] = DCMD_BAL |
             ((uint32_t)DCMD_PC_TRISTATE << DCMD_PC0_SHIFT) |
             ((uint32_t)DCMD_PC_TRISTATE << DCMD_PCC_SHIFT) |
             shield_a |
             ((uint32_t)DCMD_LOOP_TMRB << DCMD_LOOP_SHIFT);

    /* convert, and wait for end of conversion before moving on */
    cmd[3] = DCMD_CONV | DCMD_MSTART |
             ((uint32_t)DCMD_PC_TRISTATE << DCMD_PC0_SHIFT) |
             ((uint32_t)DCMD_PC_TRISTATE << DCMD_PCC_SHIFT) |
             shield_a |
             ((uint32_t)DCMD_LOOP_ADC_EOC << DCMD_LOOP_SHIFT);

