sulaolab/sonora-ak-nano/src/app/hal_touch/nora_itc_dspic33ak.c
    /* ---- Sample B: the same four with both polarities swapped -------- */
    cmd[4] = DCMD_SECOND | DCMD_DISCHRG |
             ((uint32_t)DCMD_PC_HIGH << DCMD_PC0_SHIFT) |
             ((uint32_t)DCMD_PC_LOW  << DCMD_PCC_SHIFT) |
             shield_b |
             ((uint32_t)DCMD_LOOP_TMRA << DCMD_LOOP_SHIFT);

    cmd[5] = DCMD_SECOND |
             ((uint32_t)DCMD_PC_TRISTATE << DCMD_PC0_SHIFT) |
             ((uint32_t)DCMD_PC_TRISTATE << DCMD_PCC_SHIFT) |
             shield_b;

    cmd[6] = DCMD_SECOND | DCMD_BAL |
             ((uint32_t)DCMD_PC_TRISTATE << DCMD_PC0_SHIFT) |
             ((uint32_t)DCMD_PC_TRISTATE << DCMD_PCC_SHIFT) |
             shield_b |
             ((uint32_t)DCMD_LOOP_TMRB << DCMD_LOOP_SHIFT);

    /* last command of the sequence: convert, run the math, END */
    cmd[7] = DCMD_SECOND | DCMD_CONV | DCMD_MSTART | DCMD_END |
             ((uint32_t)DCMD_PC_TRISTATE << DCMD_PC0_SHIFT) |
             ((uint32_t)DCMD_PC_TRISTATE << DCMD_PCC_SHIFT) |
             shield_b |
             ((uint32_t)DCMD_LOOP_ADC_EOC << DCMD_LOOP_SHIFT);

    /* SDATAMAP: groups 0 and 1 (SDATACMD0..3 and SDATACMD4..7) both belong to
     * sequence 4, at 8-command granularity, so the eight commands above are one
     * sequence. Groups 2 and 3 are left as they are — nothing points at them. */
    itc_reg_field_write(&SDATAMAP, DATAMAP_SEQ_SHIFT + (0u * MAP_GROUP_STRIDE),
                        0x7u, ITC_SEQ_ACQUISITION);
    itc_reg_field_write(&SDATAMAP, DATAMAP_SPLIT_SHIFT + (0u * MAP_GROUP_STRIDE),
                        0x3u, MAP_SPLIT_8CMD);
    itc_reg_field_write(&SDATAMAP, DATAMAP_SEQ_SHIFT + (1u * MAP_GROUP_STRIDE),
                        0x7u, ITC_SEQ_ACQUISITION);
    itc_reg_field_write(&SDATAMAP, DATAMAP_SPLIT_SHIFT + (1u * MAP_GROUP_STRIDE),
                        0x3u, MAP_SPLIT_8CMD);
}

/* ---------------------------------------------------------------------------
 * The math sequence
 *
 * The ALU makes the subtraction free, which is the whole reason the CPU has no
 * per-sample work to do here:
 *
 *   command 0, run after sample A's conversion: take the ADC result as A,
 *   function = A, store it in accumulator B, write nothing anywhere.
 *   command 1, run after sample B's conversion: B input = accumulator B (that
 *   is sample A), A input = the new ADC result, function = B - A, always save.
 *   The save target is the record's own ITCRESx, chosen by BIN's encoding of
 *   where results live rather than by an address we compute.
 *
 * Accumulation across the 2^ACCCNT repeats is the hardware's, not ours: with
 * ACCEN set the sequencer re-runs the pair and sums into ITCRESx.
 * ------------------------------------------------------------------------- */
static void itc_program_math_sequence(void)
{
    volatile uint32_t *cmd = ITC_MATHCMD_ARRAY;
    uint8_t            group;

    /* There are *two* math sequences, not one sequence of two commands, and the
     * difference is the whole pseudo-differential measurement.
     *
     * SDATACMDx.MSTART launches "the math sequence" after each conversion, and
     * SDATACMDx.SECOND is what says which one. So the sample-A command and the
     * sample-B command have to live in separate sequences, selected by the
     * acquisition command that triggered them. Put both in one sequence — the
     * first attempt here — and every MSTART runs both: sample A latches itself
     * into accumulator B and then immediately computes AccB - A = 0 and writes
     * it. Found on hardware 2026-08-13: the list scanned, the records were
     * accepted, the timers were right, and all three counts read exactly 0.
     *
     * The mapping is 8-command granularity (SPLIT = 2), so the first sequence
     * starts at SMATHCMD0 (group 0) and the second at SMATHCMD8 (group 2).
     * One command each, so each carries END. */

    /* First math sequence — sample A: latch the conversion into accumulator B
     * and write nothing out. */
    cmd[0] = ((uint32_t)MCMD_AIN_ADC5 << MCMD_AIN_SHIFT) |
             ((uint32_t)MCMD_F_A      << MCMD_F_SHIFT)   |
             ((uint32_t)MCMD_WM_NEVER << MCMD_WM_SHIFT)  |
             MCMD_ACCB | MCMD_END;

    /* Second math sequence — sample B, in two steps, because the difference has
     * to be *added to* ITCRESx and not written over it.
     *
     * ACCCNT repeats the acquisition+math pair 2^ACCCNT times per record before
     * the result is stored, but nothing in the hardware sums the repeats for
     * you: that is what F = BIN + AIN with BIN = ITCRESx is for (§8). Writing
     * the difference with WM = always instead makes every repeat overwrite the
     * last, so the stored result is a single measurement whatever ACCCNT says.
     * Found on hardware 2026-08-14: raising ACCCNT from 4 to 8 left the count
     * unchanged at ~-3410 instead of scaling by 16, and a finger showed up as
     * per-scan scatter of ~200 counts — mains hum, sampled at one phase per
     * scan and never averaged — rather than as a shift.
     *
     * So: latch Sample A - Sample B into accumulator A, writing nothing, then
     * add accumulator A into ITCRESx. */
    cmd[8] = ((uint32_t)MCMD_AIN_ADC5      << MCMD_AIN_SHIFT) |
             ((uint32_t)MCMD_BIN_ACCB      << MCMD_BIN_SHIFT) |
             ((uint32_t)MCMD_F_B_MINUS_A   << MCMD_F_SHIFT)   |
             ((uint32_t)MCMD_WM_NEVER      << MCMD_WM_SHIFT)  |
             MCMD_ACCA;

    cmd[9] = ((uint32_t)MCMD_AIN_ACCA      << MCMD_AIN_SHIFT) |
             ((uint32_t)MCMD_BIN_RESULT    << MCMD_BIN_SHIFT) |
             ((uint32_t)MCMD_F_B_PLUS_A    << MCMD_F_SHIFT)   |
             ((uint32_t)MCMD_WM_ALWAYS     << MCMD_WM_SHIFT)  |
             MCMD_END;

    /* The data sheet states three "must match" rules for the MAP registers, all
     * of which fail silently: MATHSEQn must equal ITCLSxSEQ.MATHSEQ, SECONDn
     * must be set iff the acquisition command's SECOND is, and ACCn must be set
     * whenever ACCCNT != 0. This HAL always accumulates (ACCEN is required even
     * for a single measurement), so ACCn is unconditional. CMPn is clear
     * because this HAL leaves the comparator off, CM = 0. */
    for (group = 0u; group <= 2u; group += 2u) {
        uint32_t base = (uint32_t)group * MAP_GROUP_STRIDE;

        itc_reg_field_write(&SMATHMAP, MATHMAP_SEQ_SHIFT + base, 0x7u,
                            ITC_SEQ_MATH);
        itc_reg_field_write(&SMATHMAP, MATHMAP_SPLIT_SHIFT + base, 0x3u,
                            MAP_SPLIT_8CMD);
        itc_reg_field_write(&SMATHMAP, MATHMAP_ACC_BIT + base, 0x1u, 1u);
        itc_reg_field_write(&SMATHMAP, MATHMAP_CMP_BIT + base, 0x1u, 0u);
        itc_reg_field_write(&SMATHMAP, MATHMAP_SECOND_BIT + base, 0x1u,
                            (group == 0u) ? 0u : 1u);
    }
}

/* ---------------------------------------------------------------------------
 * ADC 5
 * ------------------------------------------------------------------------- */
static nora_itc_status_t itc_adc5_start(void)
{
    uint32_t timeout = AD5_READY_TIMEOUT;

    if (AD5CONbits.ON == 0u) {
        AD5CONbits.ON = 1u;
    }

