sulaolab/sonora-ak-nano/src/app/hal_touch/nora_itc_dspic33ak.c
    while ((AD5CONbits.ADRDY == 0u) && (timeout != 0u)) {
        timeout--;
    }
    if (AD5CONbits.ADRDY == 0u) {
        return NORA_ITC_ERR_ADC_NOT_READY;
    }

    /* Channel 5 is the CVD channel: its positive input is the touch mux, its
     * negative input is VSS, and it is triggered by the ITC and by nothing
     * else. FRAC/DIFF stay clear — the difference we want is the ITC's
     * A-minus-B in the math ALU, not the converter's differential mode. */
    AD5CH5CON1bits.TRG1SRC = AD5_TRG1SRC_ITC;
    AD5CH5CON1bits.TRG2SRC = 0u;
    AD5CH5CON1bits.PINSEL  = AD5_PINSEL_CVD;
    AD5CH5CON1bits.NINSEL  = AD5_NINSEL_VSS;
    AD5CH5CON1bits.DIFF    = 0u;
    AD5CH5CON1bits.FRAC    = 0u;

    return NORA_ITC_OK;
}

/* ---------------------------------------------------------------------------
 * ITC core
 * ------------------------------------------------------------------------- */
static nora_itc_status_t itc_core_start(void)
{
    uint32_t timeout = ITC_READY_TIMEOUT;

    if (itc_hardware_started) {
        return NORA_ITC_OK;
    }

    /* SIGN is set unconditionally. The pseudo-differential result is signed,
     * and a cleared SIGN is not a mode — it is a measurement that reads as a
     * huge positive number whenever the difference goes the other way, which
     * looks like an electrical fault and is not one. */
    ITCCON1bits.SIGN = 1u;
    ITCCON1bits.ON   = 1u;

    /* DRDY after ON is the documented handshake. Skipping it leaves a
     * peripheral that reads back as configured and does nothing. */
    while ((ITCSTATbits.DRDY == 0u) && (timeout != 0u)) {
        timeout--;
    }
    if (ITCSTATbits.DRDY == 0u) {
        ITCCON1bits.ON = 0u;
        return NORA_ITC_ERR_NOT_READY;
    }

    ITCCON1bits.CVDEN = 1u;

#if defined(ENA_TOUCH_SHIELD_PHASE)
    /* ITCTXA bit x selects CVDTXx into group A, whose drive is the commands' PCA
     * field (DS70005591 p.1456-1458). Bit 23 is CVDTX23 = RP69 = RE4, which on
     * this board is the touch shield copper through R10 = 100 ohm (R11 DNP, so
     * that copper has no ground of its own and is meant to be driven). */
    ITCTXA = (1uL << 23u);
#else
    ITCTXA = 0uL;
#endif

    itc_program_acquisition_sequence();
    itc_program_math_sequence();

    itc_hardware_started = true;
    return NORA_ITC_OK;
}

static void itc_program_records(const nora_itc_list_config_t *config)
{
    volatile uint32_t *rec = ITC_REC_ARRAY;
    uint8_t i;

    for (i = 0u; i < config->record_count; i++) {
        const nora_itc_record_config_t *rc = &config->records[i];
        uint32_t shift = ITC_REC_SHIFT(i);
#if defined(ENA_TOUCH_SHIELD_PHASE)
        /* Guards are forced off, not merely expected to be off. Group A holds
         * both the CVDTXx pins selected in ITCTXA *and* whatever GRDA/GRDB
         * select, and GRDA/GRDB select the adjacent CVDANx *electrode* -- on this
         * board the adjacent channel of every pad is that pad's own redundant
         * channel (CVDAN8's PIN+1 is CVDAN9, same copper). A phase-driven PCA
         * with a guard selected would therefore drive the node being measured.
         * Overriding here rather than asserting keeps the shield experiment from
         * depending on a caller that is free to change. */
        uint32_t half  = ((uint32_t)rc->cvdan & ITC_REC_PIN_MASK) |
                         ((uint32_t)NORA_ITC_GUARD_NONE << ITC_REC_GRDA_SHIFT) |
                         ((uint32_t)NORA_ITC_GUARD_NONE << ITC_REC_GRDB_SHIFT);
#else
        uint32_t half  = ((uint32_t)rc->cvdan & ITC_REC_PIN_MASK) |
                         ((uint32_t)rc->guard_a << ITC_REC_GRDA_SHIFT) |
                         ((uint32_t)rc->guard_b << ITC_REC_GRDB_SHIFT);
#endif
        uint32_t word  = rec[ITC_REC_WORD(i)];

        word &= ~(ITC_REC_HALF_MASK << shift);
        word |= (half << shift);
        rec[ITC_REC_WORD(i)] = word;
    }
}

/* ---------------------------------------------------------------------------
 * Public API
 * ------------------------------------------------------------------------- */
nora_itc_status_t nora_itc_init(nora_itc_list_t list,
                                const nora_itc_list_config_t *config)
{
    const itc_list_regs_t *regs;
    itc_list_state_t      *state;
    nora_itc_status_t      status;
    uint16_t               charge_counts = 0u;
    uint16_t               balance_counts = 0u;
    uint16_t               period_counts = 0u;
    uint32_t               con;
    uint32_t               seq;

    if (!itc_list_valid(list) || (config == NULL) ||
        (config->records == NULL) ||
        (config->record_count == 0u) ||
        (config->record_count > NORA_ITC_RECORD_MAX) ||
        (config->cvdcap > NORA_ITC_CVDCAP_MAX) ||
        (config->acc_count > NORA_ITC_ACCCNT_MAX) ||
        (config->clock_hz < 1000000UL)) {
        return NORA_ITC_ERR_INVALID_ARG;
    }

    regs  = &itc_list_regs[list];
    state = &itc_state[list];

    if (!itc_ns_to_counts(config->clock_hz, config->charge_ns,
                          ITC_TIMER_MAX, &charge_counts) ||
        !itc_ns_to_counts(config->clock_hz, config->balance_ns,
                          ITC_TIMER_MAX, &balance_counts)) {
        state->last_status = NORA_ITC_ERR_TIMING;
        return NORA_ITC_ERR_TIMING;
    }

    if (config->trigger == NORA_ITC_TRIGGER_INTERNAL_TIMER) {
        /* TMRPR is documented in the same TAD unit as the sequencer timers, so
         * the period is converted the same way; at 20 ns per count the whole
         * 16-bit range is only 1.31 ms, which is why a panel scan period is
         * built by the caller re-triggering rather than by one long period.
         * A period that does not fit is refused, not truncated. */
        if (!itc_ns_to_counts(config->clock_hz, config->period_us * 1000UL,
                              ITC_TMRPR_MAX, &period_counts)) {
            state->last_status = NORA_ITC_ERR_TIMING;
            return NORA_ITC_ERR_TIMING;
        }
    }

    status = itc_adc5_start();
    if (status != NORA_ITC_OK) {
        state->last_status = status;
        return status;
    }

    status = itc_core_start();
    if (status != NORA_ITC_OK) {
        state->last_status = status;
        return status;
    }

