sulaolab/sonora-ak-nano/src/app/hal_touch/nora_itc_dspic33ak.c
    /* Stop the list before rewriting it: a list that is armed while its record
     * count and sequence numbers change scans a half-described panel. */
    *regs->CON &= ~((1uL << LSCON_TRGEN_BIT) | (1uL << LSCON_SAMP_BIT));

    /* Self-capacitance connects no pins together — ITCLSxMUL is the mutual-capacitance
     * / gang-drive knob and self-cap wants it empty. */
    *regs->MUL = 0u;

    itc_program_records(config);

    *regs->TMR = ((uint32_t)charge_counts) |
                 ((uint32_t)balance_counts << 8u);

    seq  = 0u;
    seq |= ((uint32_t)config->acc_count << LSSEQ_ACCCNT_SHIFT);
    seq |= (1uL << LSSEQ_ACCEN_BIT);   /* required even for a single sample */
    seq |= ((uint32_t)ITC_SEQ_MATH        << LSSEQ_MATHSEQ_SHIFT);
    seq |= ((uint32_t)ITC_SEQ_ACQUISITION << LSSEQ_DATASEQ_SHIFT);
    seq |= ((uint32_t)config->cvdcap      << LSSEQ_CVDCAP_SHIFT);
    *regs->SEQ = seq;

    con  = 0u;
    con |= ((uint32_t)(config->record_count - 1u) & LSCON_RECCNT_MASK)
           << LSCON_RECCNT_SHIFT;
    con |= ((uint32_t)((config->mode == NORA_ITC_SCAN_LIST_IRQ_END)
                        ? ITC_MODE_LIST_IRQ_END : ITC_MODE_LIST_NO_IRQ))
           << LSCON_MODE_SHIFT;
    con |= (1uL << LSCON_TRGCLR_BIT);  /* one scan per trigger, not a free run */

    if (config->trigger == NORA_ITC_TRIGGER_INTERNAL_TIMER) {
        con |= ((uint32_t)ITC_SSRC_INTERNAL_TIMER << LSCON_SSRC_SHIFT);
    } else {
        con |= ((uint32_t)ITC_SSRC_SOFTWARE << LSCON_SSRC_SHIFT);
    }
    *regs->CON = con;

    /* TMRPR belongs to the internal timer alone. */
    if (config->trigger == NORA_ITC_TRIGGER_INTERNAL_TIMER) {
        ITCCON2bits.TMRPR = period_counts;
    }

    /* TRGEN gates the list's trigger whatever the source is, software included:
     * it is "this list may run", not "the timer may run". Found on hardware
     * 2026-08-13 — with it set only on the timer path, a software-triggered list
     * reported configured and DRDY-ready and then never started, because the
     * SAMP 1->0 edge was gated off. BUSY never set, ACCDONE never set, and
     * nora_itc_scan_complete() timed out with next_record still 0, which reads
     * exactly like a dead electrode. Enable it for both paths. */
    *regs->CON |= (1uL << LSCON_TRGEN_BIT);
    switch (list) {
    case NORA_ITC_LIST_0: ITCCON2bits.TRGEN0 = 1u; break;
    case NORA_ITC_LIST_1: ITCCON2bits.TRGEN1 = 1u; break;
    default:              ITCCON2bits.TRGEN2 = 1u; break;
    }

    state->initialized     = true;
    state->scan_running    = false;
    state->record_count    = config->record_count;
    state->cvdcap          = config->cvdcap;
    state->acc_count       = config->acc_count;
    state->clock_hz        = config->clock_hz;
    state->charge_counts   = charge_counts;
    state->balance_counts  = balance_counts;
    state->scans_completed = 0u;
    state->trigger         = config->trigger;
    state->last_status     = NORA_ITC_OK;

    return NORA_ITC_OK;
}

nora_itc_status_t nora_itc_deinit(nora_itc_list_t list)
{
    const itc_list_regs_t *regs;
    uint8_t i;

    if (!itc_list_valid(list)) {
        return NORA_ITC_ERR_INVALID_ARG;
    }

    regs = &itc_list_regs[list];
    *regs->CON &= ~((1uL << LSCON_TRGEN_BIT) | (1uL << LSCON_SAMP_BIT));

    switch (list) {
    case NORA_ITC_LIST_0: ITCCON2bits.TRGEN0 = 0u; break;
    case NORA_ITC_LIST_1: ITCCON2bits.TRGEN1 = 0u; break;
    default:              ITCCON2bits.TRGEN2 = 0u; break;
    }

    itc_state[list].initialized  = false;
    itc_state[list].scan_running = false;
    itc_state[list].callback     = NULL;

    /* Turn the core off only when no list still wants it, and leave ADC 5 and
     * the clock alone in every case: this HAL did not create either. */
    for (i = 0u; i < NORA_ITC_LIST_COUNT; i++) {
        if (itc_state[i].initialized) {
            return NORA_ITC_OK;
        }
    }
    ITCCON1bits.CVDEN   = 0u;
    ITCCON1bits.ON      = 0u;
    itc_hardware_started = false;

    return NORA_ITC_OK;
}

nora_itc_status_t nora_itc_scan_start(nora_itc_list_t list)
{
    const itc_list_regs_t *regs;
    itc_list_state_t      *state;

    if (!itc_list_valid(list)) {
        return NORA_ITC_ERR_INVALID_ARG;
    }

    state = &itc_state[list];
    if (!state->initialized) {
        return NORA_ITC_ERR_NOT_INITIALIZED;
    }
    /* Refusing here keeps the two trigger models from being half-mixed: a
     * software start on a timer-driven list would race the timer. */
    if (state->trigger != NORA_ITC_TRIGGER_SOFTWARE) {
        return NORA_ITC_ERR_UNSUPPORTED;
    }

    regs = &itc_list_regs[list];
    if ((*regs->STAT & (1uL << LSSTAT_BUSY_BIT)) != 0u) {
        return NORA_ITC_ERR_BUSY;
    }

    /* Re-arm the trigger every scan. TRGCLR is set, which is what makes one
     * trigger mean one scan — and it clears TRGEN when the scan finishes, so a
     * TRGEN written once at init only ever buys the first scan. Confirmed on
     * hardware 2026-08-13: a register dump taken after a successful scan showed
     * TRGEN back at 0. Setting it here is idempotent and costs one OR. */
    *regs->CON |= (1uL << LSCON_TRGEN_BIT);

    /* Arm, then start. SAMP = 1 holds the acquisition, SAMP = 0 releases it —
     * writing 0 without the 1 first does nothing at all. */
    *regs->CON |= (1uL << LSCON_SAMP_BIT);
    *regs->CON &= ~(1uL << LSCON_SAMP_BIT);

    state->scan_running = true;
    return NORA_ITC_OK;
}

bool nora_itc_scan_complete(nora_itc_list_t list)
{
    const itc_list_regs_t *regs;
    volatile uint32_t     *rec;
    uint8_t                i;

    if (!itc_list_valid(list) || !itc_state[list].initialized) {
        return false;
    }

    regs = &itc_list_regs[list];
    if ((*regs->STAT & (1uL << LSSTAT_BUSY_BIT)) != 0u) {
        return false;
    }

    /* BUSY going away is necessary but not sufficient — a list that never
     * started is also not busy. Completion is every record's ACCDONE. */
    rec = ITC_REC_ARRAY;
    for (i = 0u; i < itc_state[list].record_count; i++) {
        uint32_t word = rec[ITC_REC_WORD(i)] >> ITC_REC_SHIFT(i);
        if ((word & (1uL << ITC_REC_ACCDONE_BIT)) == 0u) {
            return false;
        }
    }

