sulaolab/sonora-ak-nano/src/app/hal_touch/nora_itc_dspic33ak.c
    return true;
}

nora_itc_status_t nora_itc_read(nora_itc_list_t list, uint8_t record_index,
                                int32_t *result)
{
    itc_list_state_t *state;

    if (!itc_list_valid(list) || (result == NULL)) {
        return NORA_ITC_ERR_INVALID_ARG;
    }
    state = &itc_state[list];
    if (!state->initialized) {
        return NORA_ITC_ERR_NOT_INITIALIZED;
    }
    if (record_index >= state->record_count) {
        return NORA_ITC_ERR_INVALID_ARG;
    }

    /* Reading ITCRESx is what clears that record's ACCDONE, so this call is the
     * one that consumes completion. Results are signed by construction. */
    *result = (int32_t)ITC_RES_ARRAY[record_index];
    return NORA_ITC_OK;
}

nora_itc_status_t nora_itc_read_all(nora_itc_list_t list, int32_t *results,
                                    uint8_t results_len)
{
    itc_list_state_t *state;
    uint8_t           i;

    if (!itc_list_valid(list) || (results == NULL)) {
        return NORA_ITC_ERR_INVALID_ARG;
    }
    state = &itc_state[list];
    if (!state->initialized) {
        return NORA_ITC_ERR_NOT_INITIALIZED;
    }
    if (results_len < state->record_count) {
        return NORA_ITC_ERR_INVALID_ARG;
    }

    for (i = 0u; i < state->record_count; i++) {
        results[i] = (int32_t)ITC_RES_ARRAY[i];
    }

    state->scan_running = false;
    state->scans_completed++;
    return NORA_ITC_OK;
}

/* ---------------------------------------------------------------------------
 * Interrupt
 *
 * One vector serves all three lists; ITCSTAT.INT0/1/2 says which fired. Writes
 * to IFS10 / IEC10 / IPC40 name one bit with a compile-time-constant value,
 * because the compiler emits a single-bit atomic write only then: the shared
 * word carries other subsystems' bits, and a read-modify-write of the whole
 * word can drop one of theirs.
 *
 * The ISR is compiled only under NORA_ITC_USE_INTERRUPT. This HAL is an
 * independent implementation that drives the ITC directly, and any other code
 * that defines _ITCInterrupt in the same image fails the link on a duplicate
 * symbol; the two could not share the peripheral either, so exactly one owner
 * of touch per build is the rule and not a workaround. Bring-up is by polling
 * (nora_itc_scan_complete), which is what the console wants anyway, and
 * nora_itc_irq_enable() refuses instead of half-working when the ISR is not
 * compiled in.
 * ------------------------------------------------------------------------- */
#if defined(NORA_ITC_USE_INTERRUPT)
nora_itc_status_t nora_itc_irq_enable(nora_itc_list_t list, uint8_t priority,
                                      nora_itc_scan_callback_t callback)
{
    if (!itc_list_valid(list) || (callback == NULL) ||
        (priority == 0u) || (priority > 7u)) {
        return NORA_ITC_ERR_INVALID_ARG;
    }
    if (!itc_state[list].initialized) {
        return NORA_ITC_ERR_NOT_INITIALIZED;
    }

    itc_state[list].callback = callback;

    _ITCIF = 0;
    _ITCIP = priority;
    _ITCIE = 1;

    return NORA_ITC_OK;
}

nora_itc_status_t nora_itc_irq_disable(nora_itc_list_t list)
{
    uint8_t i;

    if (!itc_list_valid(list)) {
        return NORA_ITC_ERR_INVALID_ARG;
    }

    itc_state[list].callback = NULL;

    /* The vector is shared, so it is only disabled once no list wants it. */
    for (i = 0u; i < NORA_ITC_LIST_COUNT; i++) {
        if (itc_state[i].callback != NULL) {
            return NORA_ITC_OK;
        }
    }
    _ITCIE = 0;
    _ITCIF = 0;

    return NORA_ITC_OK;
}

/*
 * `context` not `no_auto_psv`: the alternate W0-W7 array is inherently tied to the IPL
 * on dsPIC33A, so each nesting level gets its own bank and this thunk needs no prologue
 * push -- and a prologue push at an ISR's first instruction is the documented trigger of
 * the A1 silicon STACK ERROR. Rationale in full above the vectors in
 * nora_i2c_dspic33ak_device.c; the DO-NOT-REVERT case is in the application-level
 * ASRC clock control.
 */
void __attribute__((interrupt, context)) _ITCInterrupt(void)
{
    uint8_t i;

    for (i = 0u; i < NORA_ITC_LIST_COUNT; i++) {
        const itc_list_regs_t *regs = &itc_list_regs[i];

        if ((*regs->STAT & (1uL << LSSTAT_INT_BIT)) == 0u) {
            continue;
        }
        *regs->STAT &= ~(1uL << LSSTAT_INT_BIT);

        if (itc_state[i].callback != NULL) {
            itc_state[i].callback((nora_itc_list_t)i);
        }
    }

    _ITCIF = 0;
}

#else  /* !NORA_ITC_USE_INTERRUPT */

nora_itc_status_t nora_itc_irq_enable(nora_itc_list_t list, uint8_t priority,
                                      nora_itc_scan_callback_t callback)
{
    (void)list;
    (void)priority;
    (void)callback;
    return NORA_ITC_ERR_UNSUPPORTED;
}

nora_itc_status_t nora_itc_irq_disable(nora_itc_list_t list)
{
    (void)list;
    return NORA_ITC_ERR_UNSUPPORTED;
}

#endif /* NORA_ITC_USE_INTERRUPT */

/* ---------------------------------------------------------------------------
 * Test injection
 * ------------------------------------------------------------------------- */
nora_itc_status_t nora_itc_test_inject_enable(uint16_t value)
{
    if (!itc_hardware_started) {
        return NORA_ITC_ERR_NOT_INITIALIZED;
    }

    /* Every conversion now returns `value` instead of the converter's output,
     * which drives accumulation, the A-B arithmetic and every layer above it
     * with known numbers and no electrode. TSTDATA is written before TSTEN so
     * no scan can observe the enable with a stale value behind it. */
    ITCSTATbits.TSTDATA = value;
    ITCSTATbits.TSTEN   = 1u;
    return NORA_ITC_OK;
}

nora_itc_status_t nora_itc_test_inject_disable(void)
{
    if (!itc_hardware_started) {
        return NORA_ITC_ERR_NOT_INITIALIZED;
    }
    ITCSTATbits.TSTEN = 0u;
    return NORA_ITC_OK;
}

/* ---------------------------------------------------------------------------
 * Introspection
 * ------------------------------------------------------------------------- */
nora_itc_status_t nora_itc_get_info(nora_itc_list_t list, nora_itc_info_t *info)
{
    const itc_list_regs_t *regs;
    const itc_list_state_t *state;
    uint32_t stat;

