sulaolab/sonora-ak-nano/src/app/hal_touch/nora_itc_dspic33ak.c
    if (!itc_list_valid(list) || (info == NULL)) {
        return NORA_ITC_ERR_INVALID_ARG;
    }

    regs  = &itc_list_regs[list];
    state = &itc_state[list];
    stat  = *regs->STAT;

    info->initialized       = state->initialized;
    info->hardware_ready    = (ITCSTATbits.DRDY != 0u);
    info->list_busy         = ((stat & (1uL << LSSTAT_BUSY_BIT)) != 0u);
    info->next_record       = (uint8_t)(stat & LSSTAT_NEXT_MASK);
    info->test_inject_active = (ITCSTATbits.TSTEN != 0u);
    info->scan_running      = state->scan_running;
    info->record_count      = state->record_count;
    info->cvdcap            = state->cvdcap;
    info->acc_count         = state->acc_count;
    info->clock_hz          = state->clock_hz;
    info->charge_counts     = state->charge_counts;
    info->balance_counts    = state->balance_counts;
    info->scans_completed   = state->scans_completed;
    info->last_status       = state->last_status;

    return NORA_ITC_OK;
}

/* ---------------------------------------------------------------------------
 * Raw register readback
 *
 * Deliberately a flat table rather than a struct: it is read once, by a human,
 * during bring-up, and a table can carry the ADC 5 registers this HAL depends on
 * but does not own (AD5CON, AD5CH5CON1) next to the ITC's own — which is where
 * the coupling that makes the peripheral work either is or is not.
 * ------------------------------------------------------------------------- */
typedef struct {
    const char              *name;
    volatile const uint32_t *reg;
} itc_debug_reg_t;

#define ITC_DBG(sfr) { #sfr, (volatile const uint32_t *)&(sfr) }

static const itc_debug_reg_t itc_debug_regs[] = {
    /* The comparator hit bits are ADHIT, not "ITCHIT": the name this document
     * set once used does not exist in the DFP header. */
    ITC_DBG(ITCCON1),   ITC_DBG(ITCCON2),   ITC_DBG(ITCSTAT),  ITC_DBG(ADHIT),
    ITC_DBG(ITCLS0CON), ITC_DBG(ITCLS0SEQ), ITC_DBG(ITCLS0TMR),
    ITC_DBG(ITCLS0STAT), ITC_DBG(ITCLS0MUL),
    ITC_DBG(SDATAMAP),  ITC_DBG(SMATHMAP),
    ITC_DBG(SDATACMD0), ITC_DBG(SDATACMD1), ITC_DBG(SDATACMD2), ITC_DBG(SDATACMD3),
    ITC_DBG(SDATACMD4), ITC_DBG(SDATACMD5), ITC_DBG(SDATACMD6), ITC_DBG(SDATACMD7),
    /* The math sequence is two *sequences* of one command, at 0 and 8. */
    ITC_DBG(SMATHCMD0), ITC_DBG(SMATHCMD8), ITC_DBG(SMATHCMD9),
    ITC_DBG(ITCREC0),   ITC_DBG(ITCREC1),
    ITC_DBG(ITCRES0),   ITC_DBG(ITCRES1),   ITC_DBG(ITCRES2),
    ITC_DBG(AD5CON),    ITC_DBG(AD5CH5CON1),
};

nora_itc_status_t nora_itc_debug_reg(uint8_t index,
                                     const char **name,
                                     uint32_t *value)
{
    if ((name == NULL) || (value == NULL)) {
        return NORA_ITC_ERR_INVALID_ARG;
    }
    if (index >= (uint8_t)(sizeof(itc_debug_regs) / sizeof(itc_debug_regs[0]))) {
        return NORA_ITC_ERR_INVALID_ARG;
    }

    /* ITCRESx is in the table and reading it clears that record's ACCDONE, so a
     * dump consumes completion exactly as nora_itc_read() would. That is a fair
     * price for seeing the result words, but it means a dump between a scan and
     * a read changes the answer — stated here because it will surprise someone. */
    *name  = itc_debug_regs[index].name;
    *value = *itc_debug_regs[index].reg;
    return NORA_ITC_OK;
}

#else /* !defined(ITCLS0CON) -- no ITC on this device */

/* Every entry point, answering NORA_ITC_ERR_UNSUPPORTED. Deliberately the full
 * API rather than a shorter "the caller should not have linked this": the touch
 * layer and the console are compiled for every configuration, and a link error
 * would push a device fact out to five project files where it would be gotten
 * wrong once. A caller that ignores the status gets zero scans and a
 * nora_itc_get_info() that says initialized = false, never stale numbers. */

nora_itc_status_t nora_itc_init(nora_itc_list_t list,
                                const nora_itc_list_config_t *config)
{
    (void)list; (void)config;
    return NORA_ITC_ERR_UNSUPPORTED;
}

nora_itc_status_t nora_itc_deinit(nora_itc_list_t list)
{
    (void)list;
    return NORA_ITC_ERR_UNSUPPORTED;
}

nora_itc_status_t nora_itc_scan_start(nora_itc_list_t list)
{
    (void)list;
    return NORA_ITC_ERR_UNSUPPORTED;
}

bool nora_itc_scan_complete(nora_itc_list_t list)
{
    (void)list;
    return false;
}

nora_itc_status_t nora_itc_read(nora_itc_list_t list, uint8_t record_index,
                                int32_t *result)
{
    (void)list; (void)record_index; (void)result;
    return NORA_ITC_ERR_UNSUPPORTED;
}

nora_itc_status_t nora_itc_read_all(nora_itc_list_t list, int32_t *results,
                                    uint8_t results_len)
{
    (void)list; (void)results; (void)results_len;
    return NORA_ITC_ERR_UNSUPPORTED;
}

nora_itc_status_t nora_itc_irq_enable(nora_itc_list_t list, uint8_t priority,
                                      nora_itc_scan_callback_t callback)
{
    (void)list; (void)priority; (void)callback;
    return NORA_ITC_ERR_UNSUPPORTED;
}

nora_itc_status_t nora_itc_irq_disable(nora_itc_list_t list)
{
    (void)list;
    return NORA_ITC_ERR_UNSUPPORTED;
}

nora_itc_status_t nora_itc_test_inject_enable(uint16_t value)
{
    (void)value;
    return NORA_ITC_ERR_UNSUPPORTED;
}

nora_itc_status_t nora_itc_test_inject_disable(void)
{
    return NORA_ITC_ERR_UNSUPPORTED;
}

nora_itc_status_t nora_itc_get_info(nora_itc_list_t list, nora_itc_info_t *info)
{
    (void)list;
    if (info == NULL) {
        return NORA_ITC_ERR_INVALID_ARG;
    }
    /* Zeroed, then last_status says why: initialized = false and
     * hardware_ready = false are the truth about a part with no ITC. */
    *info = (nora_itc_info_t){ 0 };
    info->last_status = NORA_ITC_ERR_UNSUPPORTED;
    return NORA_ITC_ERR_UNSUPPORTED;
}

nora_itc_status_t nora_itc_debug_reg(uint8_t index,
                                     const char **name,
                                     uint32_t *value)
{
    (void)index; (void)name; (void)value;
    /* Not INVALID_ARG: the console walks index upward until INVALID_ARG, so
     * returning it would print "0 registers" and read as a healthy empty dump.
     * UNSUPPORTED stops the walk AND says why. */
    return NORA_ITC_ERR_UNSUPPORTED;
}

#endif /* defined(ITCLS0CON) */
